#ifndef CONSTANTS_INCLUDED
#define CONSTANTS_INCLUDED

// размеры окна
const unsigned int SCR_WIDTH = 800;
const unsigned int SCR_HEIGHT = 600;

// точки фигуры
const float piramid[][3]{
        {0.0f, 0.0f, 2.0f}, // вершина пирамиды 0
        {0.0f, 2.0f, 0.0f}, // 1
        {1.9f, 0.6f, 0.0f}, // 2
        {1.2f,-1.6f, 0.0f}, // 3
       {-1.2f,-1.6f, 0.0f}, // 4
       {-1.9f, 0.6f, 0.0f}, // 5
        {0.0f, 0.0f,-2.0f} // вершина обратной пирамиды 6
};


// индексы для построения 10 треугольников
const unsigned int indices[][3]{
    {0,1,2}, // треугольник 1
    {0,2,3}, // треуг 2
    {0,3,4}, // треуг 3
    {0,4,5}, // треуг 4
    {0,5,1},  // треуг 5
    // аналогичные 5 треуг, но с противополжной вершиной
    {6,1,2},
    {6,2,3},
    {6,3,4},
    {6,4,5},
    {6,5,1}

};

// массив цветов - фигура состоит из 10 треугольников - 10 цвветов
const float colors[][3]{
    {0.583f,  0.771f,  0.014f},
    {0.609f,  0.115f,  0.436f},
    {0.327f,  0.483f,  0.844f},
    {0.822f,  0.569f,  0.201f},
    {0.435f,  0.602f,  0.223f},
    {0.310f,  0.747f,  0.185f},
    {0.597f,  0.770f,  0.761f},
    {0.559f,  0.436f,  0.730f},
    {0.359f,  0.583f,  0.152f},
    {0.483f,  0.596f,  0.789f}
};


const float ORANGE[]={1.0f, 0.5f, 0.2f, 1.0f};
const float GREEN[]={0.0f, 0.5f, 0.2f, 1.0f};
const float RED[]={1.0f,0.0f,0.0f,1.0f};


 // единичная матрица
  const float identity_matrix[]={
        1.0f,     0.0f,   0.0f,     0.0f,
        0.0f,     1.0f,   0.0f,     0.0f,
        0.0f,     0.0f,   1.0f,     0.0f,
        0.0f,     0.0f,   0.0f,     1.0f
};



#endif // CONSTANTS_INCLUDED
